RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_dma_dw.c
/***************************************************************************//**
* \file cyhal_dma_dw.c
*
* \brief
* Implements a high level interface for interacting with the Infineon Datawire DMA.
*
********************************************************************************
* \copyright
* Copyright 2018-2021 Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cyhal_dma.h"
#include "cyhal_dma_dw.h"
#include "cyhal_dma_impl.h"
#include "cyhal_hwmgr_impl.h"
#include "cyhal_interconnect.h"
#include "cyhal_syspm.h"
#include "cyhal_irq_psoc.h"
#include "cyhal_triggers.h"

#if (_CYHAL_DRIVER_AVAILABLE_DMA_DW)

#if defined(__cplusplus)
extern "C" {
#endif

#if (CPUSS_DW0_PRESENT==1) && (CPUSS_DW1_PRESENT==1)
#define _CYHAL_DMA_DW_NUM_CHANNELS (CPUSS_DW0_CH_NR + CPUSS_DW1_CH_NR)
#elif (CPUSS_DW0_PRESENT==1)
#define _CYHAL_DMA_DW_NUM_CHANNELS (CPUSS_DW0_CH_NR)
#endif

// These devices do not have interrupts for all channels. Channels 29 and greater are absent.
#if defined(CY_DEVICE_PSOC6A256K) || defined(CY_DEVICE_PSOC6A512K)
#define CYHAL_DMA_DW0_MAX_CONTIGUOUS_IRQ   29
#define CYHAL_DMA_DW1_MAX_CONTIGUOUS_IRQ   29
#else
#define CYHAL_DMA_DW0_MAX_CONTIGUOUS_IRQ   CPUSS_DW0_CH_NR
#define CYHAL_DMA_DW1_MAX_CONTIGUOUS_IRQ   CPUSS_DW1_CH_NR
#endif

#define _CYHAL_DMA_GET_CPUSS_IRQN_IMPL(block, channel)   cpuss_interrupts_dw##block##_##channel##_IRQn
#define _CYHAL_DMA_GET_CPUSS_IRQN(block, channel)        _CYHAL_DMA_GET_CPUSS_IRQN_IMPL(block, channel)

static cyhal_dma_t* _cyhal_dma_dw_config_structs[_CYHAL_DMA_DW_NUM_CHANNELS];

/** Default dw descriptor config */
static const cy_stc_dma_descriptor_config_t _cyhal_dma_dw_default_descriptor_config =
{
    .retrigger = CY_DMA_RETRIG_IM,
    .interruptType = CY_DMA_DESCR,                  // Overridden by cyhal_dma_cfg_t.action
    .triggerOutType = CY_DMA_DESCR_CHAIN,           // Overridden by [en/dis]able_output()
    .channelState = CY_DMA_CHANNEL_ENABLED,         // Overridden by cyhal_dma_cfg_t.action
    .triggerInType = CY_DMA_DESCR,                  // Overridden by cyhal_dma_cfg_t.action & [dis]connect_digital()
    .dataSize = CY_DMA_WORD,                        // Overridden by cyhal_dma_cfg_t.transfer_width
    .srcTransferSize = CY_DMA_TRANSFER_SIZE_DATA,   // Overriden by direction
    .dstTransferSize = CY_DMA_TRANSFER_SIZE_DATA,   // Overriden by direction
    .descriptorType = CY_DMA_1D_TRANSFER,           // Overriden by cyhal_dma_cfg_t.burst_size
    .srcAddress = 0,                                // Overriden by cyhal_dma_cfg_t.src_addr
    .dstAddress = 0,                                // Overriden by cyhal_dma_cfg_t.dst_addr
    .srcXincrement = 1U,                            // Overriden by cyhal_dma_cfg_t.src_increment
    .dstXincrement = 1U,                            // Overriden by cyhal_dma_cfg_t.dst_increment
    .xCount = 1UL,                                  // Overriden by cyhal_dma_cfg_t.length/burst_size
    .srcYincrement = 0U,                            // Overriden by cyhal_dma_cfg_t.burst_size
    .dstYincrement = 0U,                            // Overriden by cyhal_dma_cfg_t.burst_size
    .yCount = 1UL,                                  // Overriden by cyhal_dma_cfg_t.length
    .nextDescriptor = 0,
};

/** Default dw channel config */
static const cy_stc_dma_channel_config_t _cyhal_dma_dw_default_channel_config =
{
    .descriptor = 0,        // Overriden by config()
    .preemptable = false,
    .priority = 1,          // Overriden by config().priority
    .enable = false,
    .bufferable = false,
};

static bool _cyhal_dma_dw_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg);

static cyhal_syspm_callback_data_t cyhal_dma_dw_pm_callback_args = {
    .callback = &_cyhal_dma_dw_pm_callback,
    .states = (cyhal_syspm_callback_state_t)(CYHAL_SYSPM_CB_CPU_DEEPSLEEP | CYHAL_SYSPM_CB_SYSTEM_HIBERNATE),
    .next = NULL,
    .args = NULL,
    .ignore_modes = (cyhal_syspm_callback_mode_t)(CYHAL_SYSPM_BEFORE_TRANSITION | CYHAL_SYSPM_AFTER_DS_WFI_TRANSITION),
};
static bool _cyhal_dma_dw_pm_transition_pending = false;
static bool _cyhal_dma_dw_has_enabled(void)
{
    for (uint8_t i = 0; i < _CYHAL_DMA_DW_NUM_CHANNELS; i++)
        if (_cyhal_dma_dw_config_structs[i])
            return true;
    return false;
}

static bool _cyhal_dma_dw_pm_callback(cyhal_syspm_callback_state_t state, cyhal_syspm_callback_mode_t mode, void* callback_arg)
{
    CY_UNUSED_PARAMETER(state);
    CY_UNUSED_PARAMETER(callback_arg);
    bool block_transition = false;
    switch(mode)
    {
        case CYHAL_SYSPM_CHECK_READY:
            for (uint8_t i = 0; i < _CYHAL_DMA_DW_NUM_CHANNELS && !block_transition; i++)
            {
                block_transition |= (_cyhal_dma_dw_config_structs[i] != NULL) && _cyhal_dma_dw_is_busy(_cyhal_dma_dw_config_structs[i]);
            }

            _cyhal_dma_dw_pm_transition_pending = !block_transition;
            break;

        case CYHAL_SYSPM_CHECK_FAIL:
        case CYHAL_SYSPM_AFTER_TRANSITION:
            _cyhal_dma_dw_pm_transition_pending = false;
            break;
        default:
            CY_ASSERT(false);
            break;
    }
    return _cyhal_dma_dw_pm_transition_pending;
}

/** Sets the dw configuration struct */
static inline void _cyhal_dma_dw_set_obj(cyhal_dma_t *obj)
{
    _cyhal_dma_dw_config_structs[obj->resource.block_num * CPUSS_DW0_CH_NR + obj->resource.channel_num] = obj;
}

